In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [3]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [5]:
df

                   A         B         C         D
2013-01-01 -0.743550  0.004606 -0.759780  0.503893
2013-01-02 -0.106397 -2.110996 -0.620573  0.375667
2013-01-03  0.387026 -0.648020 -0.278270  0.883844
2013-01-04  0.437940  0.130675 -1.666191  0.298987
2013-01-05 -1.892479  1.004248  1.289785 -0.538821
2013-01-06 -1.380692  0.698014  2.815651  1.376084

In [10]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [17]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [23]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [36]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})

In [43]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})

In [44]:
left

   key  lval
0  foo     1
1  foo     2

In [45]:
right

   key  rval
0  foo     4
1  foo     5

In [46]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

In [47]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]

In [48]:
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])

In [49]:
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])

In [50]:
df

                     A         B
first second
bar   one    -1.189991  0.605818
      two    -0.666962 -0.447922
baz   one     0.346312 -0.528227
      two    -0.986526 -0.499141
foo   one     1.829209  0.215097
      two     0.301236  0.679852
qux   one    -0.371353  0.496570
      two     1.689679  0.519042